import {cn} from '@/lib/utils'
import {Link} from '@/i18n/routing'

export default function PrivacyPolicyPage() {
  return (
    <main className="py-32 xl:py-28 sm:py-24">
      <section className={cn('max-w-[80ch] sm:mx-4 mx-auto prose text-background', 'prose-a:text-red prose-a:hover:no-underline', 'prose-h1:text-red prose-h2:text-red')}>
        <h1 className="xl:text-[34px] sm:text-2xl">Политика конфиденциальности и обработки персональных данных</h1>

        <p>
          Данная Политика конфиденциальности и обработки персональных данных определяет порядок сбора, хранения, применения, раскрытия и передачи информации, которую{' '}
          <Link href="https://korostelev.legal" target="_blank">
            Korostelev & Partners
          </Link>{' '}
          (далее Компания) получает от пользователей и клиентов ресурса (далее Пользователь){' '}
          <Link href="https://korostelev.legal" target="_blank">
            korostelev.legal
          </Link>{' '}
          (далее — Сайт). Представленная Политика конфиденциальности распространяется на все сопутствующие ресурсы, поддомены, продукты, сервисы и услуги Компании.
        </p>

        <h2>Общие положения</h2>
        <p>Использование Пользователем Сайта означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование Сайта. Представленная Политика конфиденциальности касается только настоящего Сайта и информационных данных, которые добровольно предоставляют Пользователи. Ее действие не распространяется на сторонние ресурсы, в том числе те, на которых упоминается Сайт или на которых содержатся прямые ссылки на Сайт. Компания не проверяет достоверность персональных данных, предоставляемых Пользователем.</p>

        <h2>Персональная информация Пользователей, которую обрабатывает Компания</h2>
        <p>При посещении Сайта автоматически определяется IP-адрес пользователя, имя домена, страна регистрации IP. Компания также фиксируются факты перехода по страницам Сайта, прочая информация, которую браузер Пользователя предоставляет открыто и добровольно. Данные сведения помогают существенно упростить пользование Сайтом, сделать поиск нужных или интересных для Пользователя материалов намного быстрее и комфортнее.</p>
        <p>На Сайте реализована стандартная технология персональной настройки стилей отображения страниц и размещенного на них контента под параметры монитора Пользователя — Сookies. Сookies — это сохраняющиеся на жестком диске данные о посещаемых веб-сайтах, пользовательских настройках, персональных настройках режима просмотра контента. Реализованная на Сайте технология cookies предоставляет информацию о том, с какого стороннего ресурса был выполнен переход на Сайт, имени домена провайдера, стране посетителя, данные о загруженных материалах с Сайта. Данная технология используется и браузерными счетчиками компаний Yandex, Rambler, Google.</p>
        <p>Сookies не собирает личной или конфиденциальной информации о пользователе, данную технологию можно заблокировать при персональной работе с Сайтом, используя настройки браузера Пользователя или поставить обязательное уведомление о посылке cookies. На Сайте реализована стандартная технология подсчета количества посетителей и просмотров страниц, оценки технических возможностей хост-сервиров, рейтингов, посещаемости сторонних организаций. Данная информация позволяет Компании вести учет активности посетителей, актуальности представленного контента, его востребованности, составлять характеристику посещаемой аудитории. Подобный сбор данных также помогает Компании располагать страницы и материал наиболее удобным для пользователей образом, обеспечивать эффективное взаимодействие и безупречную работу с браузерами посетителей.</p>
        <p>Компания фиксирует информацию о перемещениях по Сайту, просматриваемых страницах в общем, а не персональном порядке. Никакие личные или индивидуальные данные без разрешения пользователей не будут использованы или переданы третьим лицам Компанией. Любая персональная информация, в том числе идентификационная, предоставляется пользователями Сайта исключительно добровольно. Все данные, которые Пользователь оставляет на Сайте собственноручно при регистрации, в ходе оформления заказа, заполнения форм (ФИО, адрес электронной почты, контактный телефон, должность, компания) сохраняются в тайне и не разглашаются. Каждый посетитель Сайта вправе отказаться от предоставления любой персональной информации и посещать ресурс на условиях абсолютной анонимности, кроме случаев, когда данные действия могут помешать корректному пользованию отдельными функциями или возможностями Сайта.</p>

        <h2>Цели обработки персональной информации Пользователей</h2>
        <p>Собранная Компанией информация о личных данных посетителей Сайта может быть применена для следующих целей: связь с Пользователем, в том числе направление уведомлений, запросов и информации, касающихся использования Сайта, работы Компании, исполнения соглашений и договоров Компании, а также обработка запросов и заявок от Пользователя; улучшение качества обслуживания клиентов и пользователей. Предоставляемые данные помогают намного эффективнее реагировать на запросы и обращения посетителей, клиентов; персонализация пользовательского опыта. Информация применяется для составления «портрета» пользователя, определения интересующего контента, актуальных для Пользователя услуг и сервисов, предоставляемых на Сайте.</p>

        <h2>Меры, применяемые для защиты персональной информации Пользователя</h2>
        <p>Компания принимает необходимые и достаточные организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.</p>

        <h2>Изменение Политики конфиденциальности</h2>
        <p>Компания оставляет за собой право менять или корректировать правила и условия Политики конфиденциальности. В случае внесения каких-либо поправок или нововведений в настоящую Политику указывается дата последнего обновления. Используя данный Сайт, Пользователь соглашается с вышеописанными правилами и условиями, а также берет на себя ответственность за периодическое ознакомление с нововведениями и изменениями в Политике конфиденциальности.</p>

        <h2>Применимое законодательство</h2>
        <p>К настоящей Политике и отношениям между Пользователем и Компанией, возникающим в связи с применением Политики конфиденциальности, подлежит применению право Российской Федерации.</p>

        <h2>Обратная связь</h2>
        <p>
          Все предложения или вопросы относительно Политики конфиденциальности Сайта Компании Пользователь вправе сообщать по нижеуказанным контактам: <Link href="mailto:maxim.korostelev@korostelev.legal">maxim.korostelev@korostelev.legal</Link>
        </p>
      </section>
    </main>
  )
}
